{
  "doc_id": "call_service_conversation_flows",
  "title": "Automated Call Service: Conversation Flows",
  "source_path": "Conversation Flows",
  "source_type": "kb",
  "version": "v1.0",
  "last_modified": "2025-10-10T12:27:32Z",
  "product_area": [
    "call_service"
  ],
  "access_tags": [
    "internal"
  ],
  "security_notes": "No customer PII. Dialogues are fabricated for training.",
  "sections": [
    {
      "section_id": "flows#overview",
      "heading_level": 1,
      "heading": "Overview",
      "path": "Conversation Flows > Overview",
      "raw_markdown": "This document contains ideal call conversation paths and turnkey scripts for three core intents:\n1) Sales, Estimate Request\n2) Support, Estimate sync issue\n3) Emergency, On call escalation\n\nEach flow includes:\n- Goals and success criteria\n- State transitions using Outlook Categories New, Qualified, Estimating, Booked\n- Required data reads and writes for CRM, Calendar, Estimating platform\n- Talk tracks with example agent and caller dialogue\n- Post call artifacts recap, tasks, logs\n\nNotes (additions)\n- Outlook is the CRM of record for this deployment; Outlook Categories represent funnel states used by the agent.\n- For compliance, the agent includes the following disclosure at greeting: \"This call may be recorded for training and quality assurance.\"\n"
    },
    {
      "section_id": "flows#sales_estimate_request_ideal",
      "heading_level": 2,
      "heading": "Flow 1: Sales, Estimate Request, Ideal",
      "path": "Conversation Flows > Sales, Estimate Request, Ideal",
      "raw_markdown": "Intent: Caller requests an on site estimate. Example service: residential wood fence.\nPrimary Systems: CRM read and write, Microsoft 365 Calendar write, Estimating Platform prepare, Email or SMS recap.\nState Transitions: New to Qualified to Estimating to Booked.\n\nSteps\n0. Disclosure. Say: \"This call may be recorded for training and quality assurance.\"\n1. Greeting and Identity. Capture name and callback number. Check CRM for existing record.\n2. Qualification. Service type, scope, address, service area check, timing window.\n3. Consent and Channel. Confirm preferred follow up SMS or email.\n4. Scheduling. Offer two or three on site estimate slots. Confirm the caller's timezone and the business timezone if different. Place event on the correct calendar with end time = start time + 1 hour (default) unless otherwise specified.\n5. Internal Prep. Generate and send Estimator Prep Packet internally. Set Outlook Category to Booked.\n6. Recap. Send concise summary and calendar invite to caller.\n\nSuccess Criteria\n- Lead created or updated in CRM with complete qualification fields\n- Calendar invite placed to the correct organizer with correct timezone and 1 hour default duration unless overridden\n- Recap sent to caller and Estimator Prep Packet delivered internally\n\nExample Dialogue\nAgent: Thank you for calling, this is Scout with Acme Fencing on behalf of ExampleCo. This call may be recorded for training and quality assurance. How can I help today?\nCaller: I would like an estimate for a six foot cedar privacy fence.\nAgent: Happy to help. May I have your name and the best callback number?\nCaller: Jordan Lee, 555 0134.\nAgent: Thank you, Jordan. Is this for the property address at 214 Oak Ridge Drive?\nCaller: Yes, that is right.\nAgent: Great. Roughly how many linear feet or which sides of the yard are you fencing?\nCaller: About 140 feet, two gates.\nAgent: Perfect. We serve that area and can send an estimator this week. I have Wednesday at 2 30 PM or Thursday at 10 00 AM. Which works better? All times are in our business timezone; if you are in a different timezone, I can convert it for you.\nCaller: Thursday at 10.\nAgent: Booked for Thursday 10 00 AM. The meeting will appear on your calendar for one hour by default. You will receive a calendar invite and a brief prep note. Do you prefer text or email for the recap?\nCaller: Text, please.\nAgent: Done. Quick summary, six foot cedar privacy fence, about 140 ft, two gates, address 214 Oak Ridge. You will meet our estimator on Thursday at 10 00 AM. Anything else I can add?\nCaller: That is all.\nAgent: Thank you, Jordan. We will see you Thursday.\n\nSystem Writes\n- CRM, contact, address, scope, service area pass, preferred channel, meeting link\n- Calendar, on site estimate event with notes; end time default = start + 1 hour; timezone recorded\n- Internal, Estimator Prep Packet task\n- Comms, Recap via SMS or email\n",
      "labels": {
        "intents": [
          "sales",
          "scheduling",
          "estimate"
        ],
        "audience_profiles": [
          "Trades"
        ]
      },
      "policy_flags": {
        "sensitive": false,
        "pricing_unvalidated": false
      }
    },
    {
      "section_id": "flows#support_estimate_sync_issue_ideal",
      "heading_level": 2,
      "heading": "Flow 2: Support, Estimate Sync to QuickBooks, Ideal",
      "path": "Conversation Flows > Support, Estimate Sync to QuickBooks, Ideal",
      "raw_markdown": "Intent: Caller reports that an estimate did not sync to QuickBooks.\nPrimary Systems: Estimating platform, QuickBooks connector, CRM case, Email or SMS recap.\n\nSteps\n0. Disclosure. Say: \"This call may be recorded for training and quality assurance.\"\n1. Greeting and Authentication. Name plus email or phone to locate customer and affected estimate ID.\n2. Triage. Confirm symptoms, last known good sync, error message if any.\n3. Quick Checks. Connector auth status, scopes, required fields present.\n4. Action. Re authenticate or remap required fields. Retry sync on the single failing estimate.\n5. Resolution. Read back the successful sync. Create a case note in CRM.\n6. Recap. Send a short summary including the estimate number and the resolution.\n\nExample Dialogue\nAgent: Thank you for calling support. This is Scout. This call may be recorded for training and quality assurance. How can I help?\nCaller: My fence estimate is not syncing to QuickBooks.\nAgent: I can help with that. What is the estimate number or the customer name?\nCaller: Estimate E 17402 for Jordan Lee.\nAgent: Found it. I see a missing currency field. I can correct that and retry the sync now. May I proceed?\nCaller: Yes.\nAgent: Done. The estimate now appears in QuickBooks as Quote Q 39214. I added a note to your CRM as well. Anything else?\nCaller: No, thanks.\nAgent: I will text you a brief summary with the quote number. Have a good day.\n\nSystem Writes\n- CRM, support case with error reason and fix steps\n- Estimating or QuickBooks, corrected field mapping and successful sync evidence\n- Comms, Recap with cross reference IDs\n",
      "labels": {
        "intents": [
          "support"
        ],
        "audience_profiles": [
          "Trades",
          "Enterprise"
        ]
      },
      "policy_flags": {
        "sensitive": false,
        "pricing_unvalidated": false
      }
    },
    {
      "section_id": "flows#emergency_oncall_escalation_ideal",
      "heading_level": 2,
      "heading": "Flow 3: Emergency, On Call Escalation, Ideal",
      "path": "Conversation Flows > Emergency, On Call Escalation, Ideal",
      "raw_markdown": "Intent: Caller signals safety or urgent service impact requiring immediate human response.\nPrimary Systems: Telephony for warm transfer and failover, SMS for callback link, Email for summary log, CRM case.\n\nSteps\n0. Disclosure. Say: \"This call may be recorded for training and quality assurance.\"\n1. Detect and Confirm. Ask Do you want me to connect you to our on call person now.\n2. Warm Transfer (constants). Attempt the primary on call destination with a 20 second timeout, one attempt. If no answer or failure, attempt the secondary destination with a 20 second timeout, one attempt.\n3. If All Fail. Send SMS with callback link to the caller and email a summary to the shared mailbox.\n4. Logging. Record call_id, timestamps, attempt order, targets, message_ids for SMS and summary email, and final disposition.\n\nExample Dialogue\nCaller: We have a gate motor sparking and it is live near a sidewalk.\nAgent: I am here to help. This sounds urgent. This call may be recorded for training and quality assurance. Do you want me to connect you to our on call technician now?\nCaller: Yes, please.\nAgent: Connecting you now. I will stay on the line until we are connected. dialing primary. No answer after 20 seconds, trying the backup line. Connected. You are now on with our on call technician. I am disconnecting. You will receive a summary text.\n\nSystem Writes\n- Logs, call_id, attempts, durations, attempted targets, message_ids for any SMS and summary email, outcome\n- Comms, SMS callback link if failover, summary email to shared mailbox\n- CRM, incident case with timestamps\n",
      "labels": {
        "intents": [
          "emergency"
        ],
        "audience_profiles": [
          "Trades",
          "Enterprise"
        ]
      },
      "policy_flags": {
        "sensitive": true,
        "pricing_unvalidated": false
      }
    }
  ]
}
