{
  "doc_id": "call_service_edge_cases",
  "title": "Automated Call Service: Edge Cases",
  "source_path": "Edge Cases",
  "source_type": "kb",
  "version": "v1.0",
  "last_modified": "2025-10-10T12:27:32Z",
  "product_area": [
    "call_service"
  ],
  "access_tags": [
    "internal"
  ],
  "security_notes": "No customer PII. Scenarios are synthetic.",
  "sections": [
    {
      "section_id": "edge_cases#brainstorm",
      "heading_level": 1,
      "heading": "Edge Case Brainstorm, Longlist",
      "path": "Edge Cases > Brainstorm",
      "raw_markdown": "The following edge cases were identified for call automation. Each may require special handling, fallbacks, or human escalation.\n\n1. Emergency transfer fails, no answer or carrier issue\n2. Returning caller not recognized, CRM lookup mismatch or duplication\n3. CRM writeback fails, expired token or missing scopes\n4. Calendar scheduling fails or wrong organizer or timezone\n5. Pricing or materials source unavailable or outdated for estimating\n6. Speech recognition failure, noise, accent, low battery\n7. Caller refuses to provide required PII, email or phone or address\n8. Service area check fails, outside coverage\n9. Duplicate lead detection conflict, multiple open opportunities\n10. Channel switch mid call, caller requests SMS or email link to continue\n11. Long silence or timeouts or repeated I did not catch that loops\n12. Sensitive request or prohibited topic, security or compliance\n13. Callback requested instead of live transfer, callback window constraints\n14. Double booking risk detected when placing events\n\nReferences\n- For diagnostics and evidence fields, see Support and Troubleshooting §0 and §5.\n- For on-call behavior constants, see On-Call Escalation Policy.\n",
      "labels": {
        "intents": [
          "sales",
          "support",
          "scheduling",
          "emergency"
        ],
        "audience_profiles": [
          "Trades",
          "Enterprise"
        ]
      },
      "policy_flags": {
        "sensitive": false,
        "pricing_unvalidated": false
      }
    },
    {
      "section_id": "edge_cases#prioritized_top3",
      "heading_level": 1,
      "heading": "Prioritized Top 3 Edge Cases",
      "path": "Edge Cases > Prioritization",
      "raw_markdown": "Prioritization is based on severity and frequency.\n\nTop 3\nA. Emergency transfer fails. Highest safety risk. Requires deterministic failover and audit trail.\nB. CRM identity mismatch or writeback failure. Blocks personalization and downstream actions such as leads and notes.\nC. Calendar scheduling failure. Direct customer impact. Breaks Sales to Booked conversion.\n\nRationale\n- A maps to Sev 1 and must work with failover and logging.\n- B is common in deployments due to data hygiene and auth scopes.\n- C impacts revenue and customer trust, and is prevalent with timezone or organizer misconfiguration.\n\nReferences\n- A (Emergency transfer fails): Support and Troubleshooting §1.1 D and On-Call Escalation Policy.\n- B (CRM identity mismatch or writeback failure): Support and Troubleshooting §1.1 A and §1.1 B.\n- C (Calendar scheduling failure): Support and Troubleshooting §1.1 C.\n\nEvidence to capture for all three\n- call_id, timestamps, request_id where available\n- Targets attempted and outcome_code where applicable\n- Any message_id for SMS or summary email sent\n",
      "labels": {
        "intents": [
          "emergency",
          "sales",
          "scheduling",
          "support"
        ],
        "audience_profiles": [
          "Trades",
          "Enterprise"
        ]
      },
      "policy_flags": {
        "sensitive": false,
        "pricing_unvalidated": false
      }
    },
    {
      "section_id": "edge_cases#examples_emergency_transfer_fails",
      "heading_level": 2,
      "heading": "Edge Case A: Emergency Transfer Fails, Examples",
      "path": "Edge Cases > Examples > Emergency Transfer Fails",
      "raw_markdown": "Example A1, Primary unanswered and secondary succeeds\nAgent: Do you want me to connect you now.\nCaller: Yes.\nAgent: Connecting. Primary line did not answer in 20 seconds. Trying backup. Connected. You are on with our on call technician. I will disconnect now and text you a summary.\n\nExample A2, Both fail with SMS and email fallback\nAgent: Connecting now. Primary and backup did not complete. I sent you a callback link by SMS and notified our team by email with your incident summary. If you reply STOP you will not receive texts. Is there a safe number or time for a callback.\n\nVerification\n- Primary attempt rings for 20 seconds (±2s); secondary attempt rings for 20 seconds (±2s) if needed.\n- If both fail, SMS callback link and summary email are confirmed delivered.\n\nLog fields to capture\n- call_id, timestamps, transfer attempt order, targets attempted\n- SMS message_id (if sent), summary email message_id (if sent)\n- final outcome\n",
      "labels": {
        "intents": [
          "emergency"
        ],
        "audience_profiles": [
          "Trades",
          "Enterprise"
        ]
      },
      "policy_flags": {
        "sensitive": true,
        "pricing_unvalidated": false
      }
    },
    {
      "section_id": "edge_cases#examples_crm_identity_or_writeback",
      "heading_level": 2,
      "heading": "Edge Case B: CRM Identity Mismatch or Writeback Failure, Examples",
      "path": "Edge Cases > Examples > CRM Identity or Writeback",
      "raw_markdown": "Example B1, Identity mismatch\nCaller: I called yesterday.\nAgent: I am not finding your record by this number. May I check by email or full name. If you prefer, I can create a new lead and merge it later.\n\nExample B2, Writeback failure\nAgent: I am logging your estimate request now. I am seeing a permissions error. I can re authenticate and capture your details locally, then push once connected. You will still receive a text summary right away.\n\nVerification\n- Identity mismatch: retest with the same number and email; personalized greeting and correct record linkage observed.\n- Writeback failure: a minimal test note is created successfully and visible in CRM.\n\nLog fields to capture\n- request_id, HTTP status code, timestamp for failing and succeeding attempts\n- associated CRM object identifiers (lead_id, contact_id, case_id) if relevant\n",
      "labels": {
        "intents": [
          "sales",
          "support"
        ],
        "audience_profiles": [
          "Trades",
          "Enterprise"
        ]
      },
      "policy_flags": {
        "sensitive": false,
        "pricing_unvalidated": false
      }
    },
    {
      "section_id": "edge_cases#examples_calendar_failure",
      "heading_level": 2,
      "heading": "Edge Case C: Calendar Scheduling Failure, Examples",
      "path": "Edge Cases > Examples > Calendar Failure",
      "raw_markdown": "Example C1, Organizer mismatch\nAgent: It looks like I cannot place the event to that calendar owner. I can offer the same time on our main calendar and include the correct organizer in the invite notes, or send you a booking link to complete in one step. What do you prefer.\n\nExample C2, Timezone conflict\nCaller: Thursday at 10 works.\nAgent: Thank you. I am seeing a timezone conflict. To avoid confusion, I will send you a link showing both your local time and ours. May I confirm your city to set the right timezone.\n\nVerification\n- Test event appears on the correct organizer calendar.\n- Timezone recorded correctly; end time defaults to start + 1 hour unless specified.\n\nLog fields to capture\n- request_id, timestamp, organizer mailbox, timezone used\n- event_id after successful creation\n",
      "labels": {
        "intents": [
          "scheduling",
          "sales"
        ],
        "audience_profiles": [
          "Trades",
          "Enterprise"
        ]
      },
      "policy_flags": {
        "sensitive": false,
        "pricing_unvalidated": false
      }
    }
  ]