{
  "doc_id": "sales_funnel_outlook",
  "title": "Sales Funnel Rules in Outlook Categories",
  "version": "v1.1",
  "labels": ["sales", "scheduling", "outlook", "crm"],
  "file_path": "knowledge/sales_funnel_outlook_1.1.json",
  "public_facing": false,
  "doc_title": "Sales Funnel Rules in Outlook Categories",
  "sections": [
    {
      "section_id": "sales_funnel_outlook#sales_funnel_rules_in_outlook_categories",
      "heading_level": 1,
      "heading": "Sales Funnel Rules in Outlook Categories",
      "path": "Sales Funnel via Outlook Categories",
      "raw_markdown": "Goal\nStandardize sales states and transitions using Outlook Categories so the agent and team share the same funnel and next best actions.\n\nNote on system of record\nOutlook is the CRM of record for this deployment. Categories on Outlook Contacts represent funnel states; Outlook Contacts + Lead Log serve as the lead/opportunity record.\n\nStates (Outlook Categories)\n• New — First contact captured by the agent.\n• Qualified — Qualification answers captured; lead is real.\n• Estimating — On-site estimate visit required. Either scheduled or in prep; estimator will produce pricing in person or in the field app.\n• Booked — Service appointment or job confirmed on calendar.\n• Closed Lost — Prospect declined or no response after threshold.\n\nTransitions and Triggers\n1) New → Qualified: checklist complete and contact preferences captured.\n2) Qualified → Estimating: site visit required; schedule or initiate prep.\n3) Estimating → Booked: service appointment confirmed after estimate acceptance.\n4) Any → Closed Lost: negative response or no reply for 30 days after two nudges.\n\nAgent Actions per Transition\n• Update the Outlook Contact Category to the current state.\n• Send a recap via preferred channel with next steps.\n• In Estimating: schedule an on-site visit and send Estimator Prep Packet internally.\n• When Booked: include the calendar invite link and preparation notes for service day.\n\nQualification Checklist\n1) Identity confirmed\n2) Service type and scope captured\n3) Service area check passed\n4) Preferred follow-up channel and time recorded\n5) Emergency language screened negative; otherwise follow escalation policy\n\nDefaults\n• Two follow-ups for New and Qualified, spaced 24 hours apart; then mark Closed Lost after 30 days of no response.\n• Recap templates live in shared mailbox; include summary of needs and links.\n• Agent reads context first from Outlook Contact and Lead Log before responding.\n\nTests\n• New → Qualified: verify Category update and recap sent.\n• Qualified → Estimating: verify Category change and that an on-site visit is scheduled or prep packet sent.\n• Estimating → Booked: verify Booked Category and invite delivery for the service appointment.\n• Closed Lost: let a test lead pass through two nudges and a 30-day no-response window; verify Category changes to Closed Lost and log entry captured.\n"
    }
  ]
}
